longmaxx/waterius/ESP8266/src/main.cpp
#include <user_interface.h>
#include <ESP8266WiFi.h>
#include <ArduinoJson.h>
#include "Logging.h"
#include "config.h"
#include "master_i2c.h"
#include "setup_ap.h"
#include "sender_http.h"
#include "voltage.h"
#include "utils.h"
#include "porting.h"
#include "json.h"
#include "sender_blynk.h"
#include "sender_mqtt.h"
#include "Ticker.h"
#include "sync_time.h"
#include "wifi_helpers.h"
#include "config.h"
#include "PulsarTHeatCounter.h"
#include <SoftwareSerial.h>

MasterI2C masterI2C;  // Для общения с Attiny85 по i2c
SlaveData data;       // Данные от Attiny85
Settings sett;        // Настройки соединения и предыдущие показания из EEPROM
CalculatedData cdata; //вычисляемые данные
HeatCounterData hcdata;// данные со счетчика тепла
SoftwareSerial SSerial(HEAT_COUNTER_PORT_RX, HEAT_COUNTER_PORT_TX);
PulsarTHeatCounter hc;
Voltage voltage;      // клас монитора питания
ADC_MODE(ADC_VCC);
Ticker voltage_ticker;

/*
Выполняется однократно при включении
*/
void setup()
{
    pinMode(HEAT_DCDC_EN_PIN, OUTPUT);
    digitalWrite( HEAT_DCDC_EN_PIN, LOW);

    memset(&cdata, 0, sizeof(cdata));
    memset(&data, 0, sizeof(data));
    memset(&hcdata, 0, sizeof(hcdata));
    LOG_BEGIN(115200); //Включаем логгирование на пине TX, 115200 8N1
    LOG_INFO(F("Booted"));

    masterI2C.begin(); // Включаем i2c master

    get_voltage()->begin();
    voltage_ticker.attach_ms(300, []()
                             { get_voltage()->update(); }); // через каждые 300 мс будет измеряться напряжение
    masterI2C.begin(); //Включаем i2c master
    
    // Настраиваем работу со счетчиком тепла
    SSerial.begin(9600);
    SSerial.write("KUKU");
    hc.begin(&SSerial, sett.hc_address);
    voltage.begin();
    digitalWrite( HEAT_DCDC_EN_PIN, HIGH);
    delay(5000);
    digitalWrite( HEAT_DCDC_EN_PIN, LOW);
}

void getHeatCounterValueF (int channel, retval_float_t* value, int* errCode)
{
    int res = hc.readActualValueF(HEAT_CHANNEL_POWER, &hcdata.power);
    if ((hcdata.errorCode == ERR_SUCCESS) && (res != ERR_SUCCESS))
        hcdata.errorCode = res;
}

void getHeatCounterData (HeatCounterData* hdata)
{
    LOG_INFO(F("Start getting heat counter data."));
    getHeatCounterValueF(HEAT_CHANNEL_POWER, &(hdata->power), &(hdata->errorCode));
    if (hdata->errorCode != ERR_SUCCESS){
     LOG_ERROR(F("Error Reading heat counter data"));   
     return;
    }
    LOG_INFO("Heat Calories: "+ String(hdata->power));
    getHeatCounterValueF(HEAT_CHANNEL_T_PODVOD, &(hdata->t_Input), &(hdata->errorCode));
    if (hdata->errorCode != ERR_SUCCESS){
     LOG_ERROR(F("Error Reading heat counter data"));   
     return;
    }
    LOG_INFO("Heat T_Input: "+ String(hdata->t_Input));
    getHeatCounterValueF(HEAT_CHANNEL_T_OBRATKA, &(hdata->t_Output), &(hdata->errorCode));
    if (hdata->errorCode != ERR_SUCCESS){
     LOG_ERROR(F("Error Reading heat counter data"));   
     return;
    }
    LOG_INFO("Heat T_Output: "+ String(hdata->t_Output));
}
void loop()
{
    uint8_t mode =  TRANSMIT_MODE;
    bool config_loaded = false;

    // спрашиваем у Attiny85 повод пробуждения и данные true) // /
    if (masterI2C.getMode(mode) && masterI2C.getSlaveData(data))
    {

        // Загружаем конфигурацию из EEPROM
        config_loaded = load_config(sett);
        sett.mode = mode;
        LOG_INFO(F("Startup mode: ") << mode);

        // Вычисляем текущие показания
        calculate_values(sett, data, cdata);
        
        if (mode == SETUP_MODE)
        {
            LOG_INFO(F("Entering in setup mode..."));
            // Режим настройки - запускаем точку доступа на 192.168.4.1
            // Запускаем точку доступа с вебсервером

            WiFi.persistent(false);
            WiFi.disconnect();

            wifi_set_mode(WIFI_AP_STA);   // Нужно ли, если есть в WifiManager?

            setup_ap(sett, data, cdata);

            wifi_shutdown();

            LOG_INFO(F("Set mode MANUAL_TRANSMIT to attiny"));
            masterI2C.sendCmd('T'); // Режим "Передача"

            LOG_INFO(F("Restart ESP"));
            LOG_END();

            LOG_INFO(F("Finish setup mode..."));
            ESP.restart();

            return; // сюда не должно дойти никогда
        }

        if (config_loaded)
        {
            if (wifi_connect(sett))
            {
                log_system_info();

                DynamicJsonDocument json_data(JSON_DYNAMIC_MSG_BUFFER);

                // Подключаемся и подписываемся на мктт
                if (is_mqtt(sett))
                {
                    connect_and_subscribe_mqtt(sett, data, cdata, json_data);
                }

                // устанавливать время только при использовани хттпс или мктт
                if (is_mqtt(sett) || is_https(sett.waterius_host))
                {
                    sync_ntp_time(sett);
                }

                voltage_ticker.detach(); // перестаем обновлять перед созданием объекта с данными
                LOG_INFO(F("Free memory: ") << ESP.getFreeHeap());

                // Формироуем JSON
                get_json_data(sett, data, cdata, json_data);
                //Получаем данные со счетчика тепла. Т.к. проснулись для передачи.
                digitalWrite( HEAT_DCDC_EN_PIN, HIGH);
                delay(2000);
                getHeatCounterData(&hcdata);
                digitalWrite( HEAT_DCDC_EN_PIN, LOW);
                
                print_wifi_mode();
                LOG_INFO(F("Connected, IP: ") << WiFi.localIP().toString());

                LOG_INFO(F("Free memory: ") << ESP.getFreeHeap());

#ifndef HTTPS_DISABLED
                if (send_http(sett, json_data))
                {
                    LOG_INFO(F("HTTP: Send OK"));
                }
                LOG_INFO(F("Free memory: ") << ESP.getFreeHeap());
#endif

#ifndef BLYNK_DISABLED
                if (send_blynk(sett, json_data))
                {
                    LOG_INFO(F("BLYNK: Send OK"));
                }
                LOG_INFO(F("Free memory: ") << ESP.getFreeHeap());
#endif

#ifndef MQTT_DISABLED
                if (is_mqtt(sett))
                if (send_mqtt_hc(sett, data, hcdata)) {
                    LOG_INFO(F("Send HC OK"));
                }

                UserClass::sendNewData(sett, data, cdata, hcdata);

                //Сохраним текущие значения в памяти.
                sett.impulses0_previous = data.impulses0;
                sett.impulses1_previous = data.impulses1;

                //Перешлем время на сервер при след. включении
                sett.wake_time = millis();

                //Перерасчет времени пробуждения
                if (mode == TRANSMIT_MODE)
                {
                    if (send_mqtt(sett, data, cdata, json_data))
                    {
                        LOG_INFO(F("MQTT: Send OK"));
                    }
                }
                else
                {
                    LOG_INFO(F("MQTT: SKIP"));
                }

                LOG_INFO(F("Free memory: ") << ESP.getFreeHeap());
#endif
                // Все уже отправили,  wifi не нужен - выключаем
                wifi_shutdown();

                update_config(sett, data, cdata);

                if (!masterI2C.setWakeUpPeriod(sett.set_wakeup))
                {
                    LOG_ERROR(F("Wakeup period wasn't set"));
                }
                else //"Разбуди меня через..."
                {
                    LOG_INFO(F("Wakeup period, min:") << sett.wakeup_per_min);
                    LOG_INFO(F("Wakeup period (adjusted), min:") << sett.set_wakeup);
                }

                store_config(sett);
            }
        }
    }
    LOG_INFO(F("Going to sleep"));
    LOG_END();

    if (!config_loaded) {
        delay(500);
        blink_led(3,1000,500);
    }
    
    masterI2C.sendCmd('Z'); // "Можешь идти спать, attiny"

    ESP.deepSleepInstant(0, RF_DEFAULT); // Спим до следущего включения EN. Instant не ждет 92мс
}